# LIBRAIRIE Datetime

Gérer les données temporelles avec Datetime
Vous aurez assez souvent à gérer des données temporelles, notamment des horodatages.

### Importation librairie

In [1]:
# Librairie spécifique de Python pour gérer les dates : datetime
# On aura accès à toutes les classes de la librairie avec leurs attributs et méthodes

import datetime

# La classse datetime
La librairie ```datetime``` contient une classe du, même nom  ```datetime```.

In [3]:
# instancier un premier objet de la classe datetime

a = datetime.datetime(2023,2,19,10,54,00)
type(a)

datetime.datetime

### méthode today() de cette classe permet de renvoyer la date et l'heure du jour

In [23]:
# afficher la date et l'heure du jour
today = datetime.datetime.today()
print(today)
type(today)
dir(today)

2023-02-22 14:22:34.857979

['__add__',
 '__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__ne__',
 '__new__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 'astimezone',
 'combine',
 'ctime',
 'date',
 'day',
 'dst',
 'fold',
 'fromisocalendar',
 'fromisoformat',
 'fromordinal',
 'fromtimestamp',
 'hour',
 'isocalendar',
 'isoformat',
 'isoweekday',
 'max',
 'microsecond',
 'min',
 'minute',
 'month',
 'now',
 'replace',
 'resolution',
 'second',
 'strftime',
 'strptime',
 'time',
 'timestamp',
 'timetuple',
 'timetz',
 'today',
 'toordinal',
 'tzinfo',
 'tzname',
 'utcfromtimestamp',
 'utcnow',
 'utcoffset',
 'utctimetuple',
 'weekday',
 'year']

### méthode strftime() permet de formater la date au format que l'on souhaite

De nombreux formats possibles


<table>
  <tr>
   <td><strong>Write</strong>
   </td>
   <td><strong>Definition</strong>
   </td>
   <td><strong>Exemple</strong>
   </td>
  </tr>
  <tr>
   <td>%a
   </td>
   <td>Returns the abbreviated day of the week
   </td>
   <td>“Mon” / “Tue” / “Wed
   </td>
  </tr>
  <tr>
   <td>%A
   </td>
   <td>Returns the full weekday "Sunday" / "Monday"
   </td>
   <td>“Sunday” / “Monday”
   </td>
  </tr>
  <tr>
   <td>%d
   </td>
   <td>Returns the number of the day in the month in digits
   </td>
   <td>01, 02, 03, 04...
   </td>
  </tr>
  <tr>
   <td>%b
   </td>
   <td>Returns the month of the year in abbreviated form 
   </td>
   <td>“Jan” / “Feb” ...
   </td>
  </tr>
  <tr>
   <td>%B
   </td>
   <td>Returns the full month of the year
   </td>
   <td>“January” / February”
   </td>
  </tr>
  <tr>
   <td>%m
   </td>
   <td>Returns the month of the year in digits
   </td>
   <td>01, 02, 03, 04...
   </td>
  </tr>
  <tr>
   <td>%y
   </td>
   <td>Returns the year in two digits
   </td>
   <td>98, 99, 00, 01
   </td>
  </tr>
  <tr>
   <td>%Y
   </td>
   <td>Returns the year in four digits
   </td>
   <td>1998, 1999, 2000, 2001
   </td>
  </tr>
  <tr>
   <td>%c
   </td>
   <td>Returns the date and time
   </td>
   <td>Tue Aug 16 21:30:00 1988
   </td>
  </tr>
  <tr>
   <td>%x
   </td>
   <td>Just return the date
   </td>
   <td>08/16/88
   </td>
  </tr>
  <tr>
   <td>%X
   </td>
   <td>Just return the time (hour)
   </td>
   <td>21:30:00
   </td>
  </tr>
  <tr>
   <td>%H
   </td>
   <td>Returns the time in 24hrs format
   </td>
   <td>“01” ”03” “22”
   </td>
  </tr>
  <tr>
   <td>%I
   </td>
   <td>Returns the time in 12hrs format
   </td>
   <td>“01” “03” “12”
   </td>
  </tr>
  <tr>
   <td>%M
   </td>
   <td>Returns minutes
   </td>
   <td>“01” “58” “59” “00”
   </td>
  </tr>
  <tr>
   <td>%S
   </td>
   <td>Returns seconds
   </td>
   <td>“01” “58” “59” “00”
   </td>
  </tr>
</table>

In [9]:
today

datetime.datetime(2023, 2, 22, 14, 10, 2, 529637)

In [10]:
today.strftime('%a')

'Wed'

In [11]:
today.strftime('%A')

'Wednesday'

In [12]:
today.strftime('%c')

'Wed Feb 22 14:10:02 2023'

In [14]:
today.strftime('%A %d %B %Y')

'Wednesday 22 February 2023'

### Attributs utiles

In [19]:
print("Day:", today.day)
print("Month:", today.month)
print("Year:", today.year)
print("Hour:", today.hour)

Day: 22
Month: 2
Year: 2023
Hour: 14

### Méthodes utiles
#### .date()       .time()

In [20]:
print('date: ', today.date())

date:  2023-02-22

In [24]:
print('Time:', today.time())

Time: 14:22:34.857979

#### .replace()
Pour changer une valeur dans la date

In [26]:
modified_date = today.replace(month=7)

In [27]:
modified_date

datetime.datetime(2023, 7, 22, 14, 22, 34, 857979)

In [28]:
modified_date = today.replace(year=2024)

In [29]:
modified_date

datetime.datetime(2024, 2, 22, 14, 22, 34, 857979)

In [30]:
#modified_date = today.replace(day=30)

ValueError: day is out of range for month

#### .weekday()
Renvoie le jour de la semaine (Monday est encodée 0, Tuesday 1, Wednesday 2, etc..):

In [31]:
weekday = today.weekday()

In [32]:
weekday

2

Méthode ISOFORMAT()

In [33]:
today.isoformat()

'2023-02-22T14:22:34.857979'

# Les classes date and time

In [35]:
# Créez un objet time, créez un objet date et combinez-les pour donner un objet datetime

one_hour = datetime.time(13,30,00)
type(one_hour)
print(one_hour)

13:30:00

In [36]:
one_date = datetime.date(1900,9,30)
type(one_date)
print(one_date)

1900-09-30

In [37]:
one_date.year

1900

In [51]:
combined = datetime.datetime.combine(one_date, one_hour)
print(combined)

1900-09-30 13:30:00

# La classe timedelta : faire des  operations sur dates and times

In [39]:
duree = datetime.timedelta(days = 10)
type(duree)

10 days, 0:00:00

In [42]:
# enlever 10 jours

new_date = one_date - duree
print(new_date)
type(new_date)

1900-09-20

datetime.date

In [48]:
# exemple : ajouter 2 heures

today = datetime.datetime.today()
print(today)

duree = datetime.timedelta(hours=2)
print(duree)

new_today = today + duree
print(new_today)

2023-02-22 14:48:14.597616
2:00:00
2023-02-22 16:48:14.597616

## Très utile : avec PANDAS

In [53]:
import pandas as pd

df = pd.DataFrame({'Date' : ["20/11/2018", "23/10/2020", "23/02/2015", "15/05/2016", "07/12/2011", "22/02/2023" ], 'Quantité' : [4,5,8,9,10,8]})
df

         Date  Quantité
0  20/11/2018         4
1  23/10/2020         5
2  23/02/2015         8
3  15/05/2016         9
4  07/12/2011        10
5  22/02/2023         8

In [54]:
df.head()

         Date  Quantité
0  20/11/2018         4
1  23/10/2020         5
2  23/02/2015         8
3  15/05/2016         9
4  07/12/2011        10

In [78]:
df.tail()

        Date  Quantité  Annee  Mois  Jour
1 2020-10-23         5   2020    10    23
2 2015-02-23         8   2015     2    23
3 2016-05-15         9   2016     5    15
4 2011-07-12        10   2011     7    12
5 2023-02-22         8   2023     2    22

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      6 non-null      datetime64[ns]
 1   Quantité  6 non-null      int64
 2   Annee     6 non-null      int64
 3   Mois      6 non-null      int64
 4   Jour      6 non-null      int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 368.0 bytes

In [100]:
df['Date']

0   2018-11-20
1   2020-10-23
2   2015-02-23
3   2016-05-15
4   2011-07-12
5   2023-02-22
Name: Date, dtype: datetime64[ns]

In [101]:
df['Quantité']

0     4
1     5
2     8
3     9
4    10
5     8
Name: Quantité, dtype: int64

In [ ]:
# Convertir la colonne date en objet datetime : avec la méthode pandas.to_datetime

In [75]:
today = datetime.datetime.today()

In [76]:
print(today)

2023-02-22 15:24:00.468065

In [59]:
df['Date'] = pd.to_datetime(df['Date'])

C:\Users\ladypro\AppData\Local\Temp\ipykernel_12876\2394721818.py:1: UserWarning: Parsing '20/11/2018' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  df['Date'] = pd.to_datetime(df['Date'])
C:\Users\ladypro\AppData\Local\Temp\ipykernel_12876\2394721818.py:1: UserWarning: Parsing '23/10/2020' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  df['Date'] = pd.to_datetime(df['Date'])
C:\Users\ladypro\AppData\Local\Temp\ipykernel_12876\2394721818.py:1: UserWarning: Parsing '23/02/2015' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  df['Date'] = pd.to_datetime(df['Date'])
C:\Users\ladypro\AppData\Local\Temp\ipykernel_12876\2394721818.py:1: UserWarning: Parsing '15/05/2016' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  df['Date'] = pd.to_datetime(df['Date'])
C:\Users\ladypro\AppData\Local\Temp\ipykernel_12876\2394721818.py:1: UserWarning: Parsing '22/02/2023' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  df['Date'] = pd.to_datetime(df['Date'])

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      6 non-null      datetime64[ns]
 1   Quantité  6 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 224.0 bytes

In [71]:
# création d'une colonne Année et d'une colonne Mois avec les attributs .year et .month

df['Annee'] = df['Date'].apply(lambda x: x.year)

In [69]:
df

        Date  Quantité  Annee
0 2018-11-20         4   2018
1 2020-10-23         5   2020
2 2015-02-23         8   2015
3 2016-05-15         9   2016
4 2011-07-12        10   2011
5 2023-02-22         8   2023

In [73]:
df['Mois'] = df['Date'].apply(lambda y: y.month)

In [74]:
df

        Date  Quantité  Annee  Mois
0 2018-11-20         4   2018    11
1 2020-10-23         5   2020    10
2 2015-02-23         8   2015     2
3 2016-05-15         9   2016     5
4 2011-07-12        10   2011     7
5 2023-02-22         8   2023     2

In [77]:
df['Jour'] = df['Date'].apply(lambda z: z.day)
df

        Date  Quantité  Annee  Mois  Jour
0 2018-11-20         4   2018    11    20
1 2020-10-23         5   2020    10    23
2 2015-02-23         8   2015     2    23
3 2016-05-15         9   2016     5    15
4 2011-07-12        10   2011     7    12
5 2023-02-22         8   2023     2    22

In [84]:
df['Jour cal'] = df['Date'].apply(lambda z: (z.day**2) - 1)
df

        Date  Quantité  Annee  Mois  Jour  Jour cal
0 2018-11-20         4   2018    11    20       399
1 2020-10-23         5   2020    10    23       528
2 2015-02-23         8   2015     2    23       528
3 2016-05-15         9   2016     5    15       224
4 2011-07-12        10   2011     7    12       143
5 2023-02-22         8   2023     2    22       483

In [85]:
df['Jour cal2'] = df['Jour'].apply(lambda z: (z**2) - 1)
df

        Date  Quantité  Annee  Mois  Jour  Jour cal  Jour cal2
0 2018-11-20         4   2018    11    20       399        399
1 2020-10-23         5   2020    10    23       528        528
2 2015-02-23         8   2015     2    23       528        528
3 2016-05-15         9   2016     5    15       224        224
4 2011-07-12        10   2011     7    12       143        143
5 2023-02-22         8   2023     2    22       483        483

In [86]:
def cube(x):
    return x**3

In [87]:
cube(5)

125

In [88]:
df['Jour cal3'] = df['Jour'].apply(cube)
df

        Date  Quantité  Annee  Mois  Jour  Jour cal  Jour cal2  Jour cal3
0 2018-11-20         4   2018    11    20       399        399       8000
1 2020-10-23         5   2020    10    23       528        528      12167
2 2015-02-23         8   2015     2    23       528        528      12167
3 2016-05-15         9   2016     5    15       224        224       3375
4 2011-07-12        10   2011     7    12       143        143       1728
5 2023-02-22         8   2023     2    22       483        483      10648

In [90]:
carre = lambda x: x**2

In [91]:
carre(5)

25

In [94]:
df['Annee_moins_10'] = df['Annee'].apply(lambda x: x - 10)
df

,Date,Quantité,Annee,Mois,Jour,Jour cal,Jour cal2,Jour cal3,Annee_moins_10
0,2018-11-20,4,2018,11,20,399,399,8000,2008
1,2020-10-23,5,2020,10,23,528,528,12167,2010
2,2015-02-23,8,2015,2,23,528,528,12167,2005
3,2016-05-15,9,2016,5,15,224,224,3375,2006
4,2011-07-12,10,2011,7,12,143,143,1728,2001
5,2023-02-22,8,2023,2,22,483,483,10648,2013

In [96]:
df['Annee_paire'] = df['Annee'].apply(lambda x: x if x%2 == 0 else 0)
df

,Date,Quantité,Annee,Mois,Jour,Jour cal,Jour cal2,Jour cal3,Annee_moins_10,Annee_paire
0,2018-11-20,4,2018,11,20,399,399,8000,2008,2018
1,2020-10-23,5,2020,10,23,528,528,12167,2010,2020
2,2015-02-23,8,2015,2,23,528,528,12167,2005,0
3,2016-05-15,9,2016,5,15,224,224,3375,2006,2016
4,2011-07-12,10,2011,7,12,143,143,1728,2001,0
5,2023-02-22,8,2023,2,22,483,483,10648,2013,0

In [98]:
df['Quantité_new'] = df['Quantité'].apply(lambda x: x if x < 8 else x**2)
df

,Date,Quantité,Annee,Mois,Jour,Jour cal,Jour cal2,Jour cal3,Annee_moins_10,Annee_paire,Quantité_new
0,2018-11-20,4,2018,11,20,399,399,8000,2008,2018,4
1,2020-10-23,5,2020,10,23,528,528,12167,2010,2020,5
2,2015-02-23,8,2015,2,23,528,528,12167,2005,0,64
3,2016-05-15,9,2016,5,15,224,224,3375,2006,2016,81
4,2011-07-12,10,2011,7,12,143,143,1728,2001,0,100
5,2023-02-22,8,2023,2,22,483,483,10648,2013,0,64

In [99]:
df['Quantité_new'] = df['Quantité'].apply(lambda x: x**2 if x >= 8 else x)
df

,Date,Quantité,Annee,Mois,Jour,Jour cal,Jour cal2,Jour cal3,Annee_moins_10,Annee_paire,Quantité_new
0,2018-11-20,4,2018,11,20,399,399,8000,2008,2018,4
1,2020-10-23,5,2020,10,23,528,528,12167,2010,2020,5
2,2015-02-23,8,2015,2,23,528,528,12167,2005,0,64
3,2016-05-15,9,2016,5,15,224,224,3375,2006,2016,81
4,2011-07-12,10,2011,7,12,143,143,1728,2001,0,100
5,2023-02-22,8,2023,2,22,483,483,10648,2013,0,64

Méthode .strptime()

In [102]:
date_string = "20/11/18 18:30"
date = datetime.datetime.strptime(date_string, "%d/%m/%y %H:%M")
print(date)
print(type(date))

2018-11-20 18:30:00
<class 'datetime.datetime'>